# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2024-08-13 20:17:52 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Silo
  Silo gathers system logs from multiple systems and provides a searchable
  aggregate view and notifications.
** Clock table
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2024-08-13 Di 20:17]
   | Headline                | Time   |        |      |      |
   |-------------------------+--------+--------+------+------|
   | *Total time*            | *4:16* |        |      |      |
   |-------------------------+--------+--------+------+------|
   | *Silo*                  | *4:16* |        |      |      |
   | \_  /Components [0/0]/  |        | /4:16/ |      |      |
   | \_    Extractor [0/0]   |        |        | 0:26 |      |
   | \_      Syslog [0/0]    |        |        |      | 0:26 |
   | \_    Database [1/1]    |        |        | 3:30 |      |
   | \_      Connection Pool |        |        |      | 0:03 |
   | \_    Network [0/0]     |        |        | 0:20 |      |
   | \_      Server [0/0]    |        |        |      | 0:20 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Extractor [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    I need to get data out of the system log(s). On BSD systems, this should
    be easy, on Linux systems using journald, it should be possible at the
    very least.
    ... Oh, I see there are Python bindings to talk to systemd. Okay, that
    shouldn't be too hard. (Of course, those are famous last words)
**** Journald
     There are Python bindings to access journald logs, it seems pretty
     straightforward.
**** Syslog [0/0]
     :LOGBOOK:
     CLOCK: [2024-08-12 Mo 20:08]--[2024-08-12 Mo 20:15] =>  0:07
     CLOCK: [2024-08-12 Mo 19:21]--[2024-08-12 Mo 19:40] =>  0:19
     :END:
*** Database [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-08-12 Mo 18:44]--[2024-08-12 Mo 19:15] =>  0:31
    CLOCK: [2024-08-12 Mo 17:47]--[2024-08-12 Mo 18:01] =>  0:14
    CLOCK: [2024-08-10 Sa 22:30]--[2024-08-11 So 00:14] =>  1:44
    CLOCK: [2024-08-10 Sa 21:19]--[2024-08-10 Sa 22:17] =>  0:58
    :END:
**** DONE Connection Pool
     CLOSED: [2024-08-13 Di 19:57]
     :LOGBOOK:
     CLOCK: [2024-08-13 Di 19:54]--[2024-08-13 Di 19:57] =>  0:03
     :END:
*** Network [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    So, do I want to use HTTP or some crude custom protocol?
**** Server [0/0]
     :LOGBOOK:
     CLOCK: [2024-08-13 Di 19:57]--[2024-08-13 Di 20:17] =>  0:20
     :END:
**** Agent [0/0]
**** Service Discovery [0/0]
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
